<?php
    $lang = [
        'close' => 'ปิด',
        'yes' => 'ใช่',
        'no' => 'ไม่',

		'mon' => 'จ.',
		'tue' => 'อ.',
		'wed' => 'พ.',
		'thu' => 'พฤ.',
		'fri' => 'ศ.',
		'sat' => 'ส.',
		'sun' => 'อา.',
		'1st10days' => '10 วันที่ 1',
		'2nd10days' => '10 วันที่ 2',
		'3rd10days' => '10 วันที่ 3',
		'total' => 'ทั้งหมด',
		'fixed' => 'แก้ไขแล้ว',
		'plan' => 'แผน',
		'amount' => 'จำนวน:K',
        
        'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
        
        'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',

        'warning1' => 'คำสั่งซื้อนี้เสร็จสมบูรณ์หรือปิดแล้ว ไม่สามารถแก้ไขหรือลบได้',
    ];
?>
