<?php
    function lang($msg) {

	    $txtbylang = [
	        'login' => 'เข้าสู่ระบบ', 
	        'compcode' => 'บริษัท', 
	        'comppwd' => 'รหัสผ่านบริษัท', 
	        'userid' => 'ผู้ใช้งาน', 
	        'userpwd' => 'รหัสผ่าน', 
	        'serverurl' => 'ที่อยู่เครื่อง', 
	        'btnlogin' => 'เข้าสู่ระบบ',
	        'language' => 'ภาษา',
         	
	        'software1' => 'ซอฟต์แวร์นี้พัฒนาโดยบริษัท คลาวด์ทูเวิร์คส์ (ประเทศไทย) จำกัด',	    
			'software2' => 'house ID ซอฟต์แวร์ของมันคือ XXXX และหมายเลขซอฟต์แวร์ของซอฟต์แวร์นี้คือ X-XXXX',
			'software3' => 'ซอฟต์แวร์นี้เป็นซอฟต์แวร์มาตรฐานของกรมสรรพากรประเภทภาษี ข‚.',     
	    ];
        return $txtbylang[$msg];    
    }
?>