<?php

    function lang($msg) {

        $lang = [
            'clear' => 'ล้าง',
            'close' => 'ปิด', 
            'yes' => 'ใช่',
            'no' => 'ไม่',
            'ok' => 'Ok',
            'nono' => 'ไม่',
            'canceled' => 'ยกเลิกแล้ว',
                    
            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question2' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',

            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
 
            'success' => 'เพิ่มรายการเข้าระบบแล้ว, บัญชีแยกประเภททั่วไปเรียบร้อยแล้ว',

        ];

        return $lang[$msg];

    }

?>
