<?php
    function lang($msg) {

        $lang = [
            'clear' => 'ล้าง',
            'close' => 'ปิด', 
            'ERRO_NOCURCD' => 'ERRO_NOCURCD',
            'ERRO_NO_CUTOMER' => 'ERRO_NO_CUTOMER',
            'ERRO_SALEORDERNO' => 'ERRO_SALEORDERNO',
            'WARN_CANCALEDQUOTE' => 'WARN_CANCALEDQUOTE',
            'yes' => 'ใช่',
            'no' => 'ไม่',
            'ok' => 'Ok',
            'nono' => 'ไม่',
            'canceled' => 'ยกเลิกแล้ว',
            'setofdocuments' => 'เอกสารออกเป็นชุด',
            'selectshipping' => 'เลือกการจัดส่งเพื่อออกใบแจ้งหนี้',
            'invoicesalevoucher' => 'ใบกำกับสินค้า / ใบสำคัญการขาย',
                                
            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question2' => 'คุณต้องการยกเลิกข้อมูลหรือไม่ ? (หลังจากดำเนินการยกเลิกแล้ว จะไม่สามารถนำข้อมูลกลับมาใช้ใหม่ได้)',
            'question3' => 'คุณต้องการบันทึกข้อมูลหรือไม่ ?',
            'question4' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',
            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
            'validation2' => 'กรุณากดปุ่มหลังจากป้อนเหตุผลของการพิมพ์',

            'erro1' => 'สต็อกน้อยกว่าที่คุณสั่งซื้อ โปรดตรวจสอบสต็อกอีกครั้งและปรับจำนวน',
            'erro2' => 'มีสินค้าคงคลังทางตรรกะไม่เพียงพอสำหรับรายการที่ครอบคลุมโดยวิธีการบันทึกแบบต่อเนื่อง ไม่สามารถดำเนินการได้',
            'erro3' => 'ไม่มีข้อมูลรายการ',

            'success' => 'เพิ่มรายการเข้าระบบแล้ว, บัญชีแยกประเภททั่วไปเรียบร้อยแล้ว',

        ];

        return !empty($lang[$msg]) ? $lang[$msg] : $msg;
    }      
?>
