<?php
    function lang($msg) {
        $lang = [
            'close' => 'ปิด',
            'yes' => 'ใช่',
            'no' => 'ไม่',
            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question2' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',
    		'question3' => 'คุณต้องการบันทึกข้อมูลหรือไม่ ?',
    		'question4' => 'คุณต้องการยกเลิกข้อมูลหรือไม่ ? (หลังจากดำเนินการยกเลิกแล้ว จะไม่สามารถนำข้อมูลกลับมาใช้ใหม่ได้)',

            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
            'validation2' => 'ไม่มีข้อมูลรายการ',      
            'validation3' => 'ก่อนหน้านี้มีการใช้หมายเลขใบแจ้งหนี้ของซัพพลายเออร์นี้',
            'validation4' => 'การบันทึกรายการเอกสารเข้าระบบ. บัญชีแยกประเภททั่วไปเรียบร้อยแล้ว',
            'validation5' => 'ไม่มีอะไรจะพิมพ์',
            'validation6' => 'วันที่ใบแจ้งหนี้ของซัพพลายเออร์ไม่ได้รับการยอมรับ',        
        ];

        return !empty($lang[$msg]) ? $lang[$msg]: $msg;    
    }        
?>
