<?php

    function lang($msg) {

        $lang = [
            'clear' => 'ล้าง',
            'close' => 'ปิด', 
            'yes' => 'ใช่',
            'no' => 'ไม่',
            'ok' => 'Ok',
                    
            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question4' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',

            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
            'validation2' => 'ไม่มีอะไรให้พิมพ์',

        ];

        return $lang[$msg];

    }

?>
