<?php
    function lang($msg) {

        $lang = [

            'close' => 'ปิด',
            'yes' => 'ใช่',
            'no' => 'ไม่',
            'csv' => 'CSV',

            'detail' => 'รายละเอียด',

            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question2' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',
            
            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
        ];

        return !empty($lang[$msg]) ? $lang[$msg] : $msg;
    }
?>
