<?php
    $lang = [
        "close" => "ปิด",
        "bankcode" => "รหัสธนาคาร",
        "bankname" => "ชื่อธนาคาร",
        "branchname" => "ชื่อสาขา",
        "branchcode" => "รหัสสาขา",
        "search" => "ค้นหา",
        "minrow" => "จำนวนแถว",
        "insert" => "เพิ่ม",
		"update" => "อัพเดท",
		"delete" => "ลบ",
		"entry" => "กรอกข้อมูล",
		"clear" => "ล้าง",
		"end" => "สิ้นสุด",
        "yes" => "ใช่",
		"nono" => "ไม่",
		"question1" => "คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่",
        "validation1" => "ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน",

    ];
?>
