<?php

    function lang($msg) {

        $lang = [
            'clear' => 'ล้าง',
            'close' => 'ปิด', 
            'yes' => 'ใช่',
            'no' => 'ไม่',
            'ok' => 'Ok',
            'nono' => 'ไม่',
            'canceled' => 'ยกเลิกแล้ว',
            'setofdocuments' => 'เอกสารออกเป็นชุด',
            'paidby' => 'จ่ายโดย',
                    
            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question2' => 'คุณต้องการยกเลิกข้อมูลหรือไม่ ? (หลังจากดำเนินการยกเลิกแล้ว จะไม่สามารถนำข้อมูลกลับมาใช้ใหม่ได้)',
            'question3' => 'คุณต้องการบันทึกข้อมูลหรือไม่ ?',
            'question4' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',
            'question5' => 'คุณต้องการบันทึกข้อมูลรูปแบบที่เกิดซ้ำหรือไม่ ?',
            'question6' => 'คุณต้องการบันทึกข้อมูลคำอธิบายหรือไม่ ?',

            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
            'validation2' => 'กรุณากดปุ่มหลังจากป้อนเหตุผลของการพิมพ์',
            'validation3' => 'ไม่มีอะไรให้พิมพ์',
            'validation4' => 'กรุณากรอกรหัสผู้จัดจำหน่าย',
            'validation5' => 'โปรดเลือกคู่ค้า',

            'erro1' => 'สต็อกน้อยกว่าที่คุณสั่งซื้อ โปรดตรวจสอบสต็อกอีกครั้งและปรับจำนวน',
            'erro2' => 'มีสินค้าคงคลังทางตรรกะไม่เพียงพอสำหรับรายการที่ครอบคลุมโดยวิธีการบันทึกแบบต่อเนื่อง ไม่สามารถดำเนินการได้',
            'erro3' => 'ไม่มีข้อมูลรายการ',

            'success' => 'เพิ่มรายการเข้าระบบแล้ว, บัญชีแยกประเภททั่วไปเรียบร้อยแล้ว',

            'ERRO:ERRO_NOTEXISTACC' => 'ไม่มีรหัสบัญชี',
            'ERRO:ERRO_NO_PAIDDETAILS' => 'ไม่มีรายละเอียดการชำระเงิน',
            'ERRO:ERRO_NOT_EQUAL_DEBIT_AND_CREDIT' => 'เดบิตและเครดิตไม่เท่ากัน',
            'ERRO:ERRO_AMOUNT_EQUAL_ZERO' => 'จำนวนเงินเท่ากับศูนย์',
            'ERRO:ERRO_EXISTS_ROW_NOT_SETTING_ACCOUNT' => 'มีแถวที่ไม่ได้ตั้งค่าบัญชี',
            'ERRO:ERRO_EXISTS_ROW_AMOUNT_ZERO' => 'มีอยู่แถวที่มีจำนวนเป็นศูนย์',
            'ERRO:ERRO_NOREMARK' => 'กรุณากรอกคำอธิบาย',

        ];

        return $lang[$msg];

    }

?>
