<?php
    function lang($msg) {
        $lang = [

            'searchcondition' => 'เงื่อนไขการค้นหา'

            'groupqoeteheader' => 'ข้อมูลส่วนหัวของใบเสนอราคา',
            'groupcustomer' => 'ลูกค้า',
            'groupqoetedetail' => 'ข้อมูลรายละเอียดใบเสนอราคา',
            'groupqoeteitem' => 'รายการใบเสนอราคา',
            'grouptotal' => 'รวม',
            'groupitemremark' => 'หมายเหตุ',
            'groupitementry' => 'แบบฟอร์มรายการสินค้า',

            'newitems' => 'รายการใหม่',
            'saveitems' => 'บันทึกรายการ',
            'deleteitems' => 'ลบรายการ',

            'yes' => 'ใช่',
            'no' => 'ไม่',
            'ok' => 'Ok',
            'close' => 'ปิด',

            'canceled' => 'ยกเลิกแล้ว',

            'question1' => 'คุณต้องการสิ้นสุดกระบวนการนี้หรือไม่ ?',
            'question2' => 'คุณต้องการยกเลิกข้อมูลหรือไม่ ? (หลังจากดำเนินการยกเลิกแล้ว จะไม่สามารถนำข้อมูลกลับมาใช้ใหม่ได้)',
            'question3' => 'คุณต้องการบันทึกข้อมูลหรือไม่ ?',
            'question4' => 'คุณต้องการพิมพ์ข้อมูลนี้หรือไม่ ?',

            'validation1' => 'ช่องบังคับทั้งหมดที่ล้อมรอบด้วยเส้นสีแดงจะต้องกรอกให้ครบถ้วน',
     
        ];

        return !empty($lang[$msg]) ? $lang[$msg] : $msg;
    }
?>
